<a href="https://colab.research.google.com/github/stutis28/PythonPractise/blob/master/concatenatingmerging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd

df1 = pd.DataFrame({'item': ['a','b','c','d'],
                    'value' : [1,2,3,4]})

df2 = pd.DataFrame({'item': ['e','f','g','h'],
                    'value': [5,6,7,8]})

print(df1)
print(df2)

  item  value
0    a      1
1    b      2
2    c      3
3    d      4
  item  value
0    e      5
1    f      6
2    g      7
3    h      8

In [0]:
df1['item'] = df1.item.str.title()

In [12]:
print(df1)
print(df2)

  item  value
0    A      1
1    B      2
2    C      3
3    D      4
  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [0]:
df2['item'] = df2.item.str.title()

In [17]:
pd.concat([df1,df2]).reset_index

<bound method DataFrame.reset_index of   item  value
0    A      1
1    B      2
2    C      3
3    D      4
0    E      5
1    F      6
2    G      7
3    H      8>

In [26]:
import pandas as pd

df3 = pd.DataFrame({'item': ['E','F','G','H'],
                    'value': [5,6,7,8]})

df4 = pd.DataFrame({'item' : ['A','B','C','D'],
                    'quantity' : [1,2,3,4]})

print(df3)
print(df4)

  item  value
0    E      5
1    F      6
2    G      7
3    H      8
  item  quantity
0    A         1
1    B         2
2    C         3
3    D         4

In [27]:
pd.concat([df3,df4])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  item  quantity  value
0    E       NaN    5.0
1    F       NaN    6.0
2    G       NaN    7.0
3    H       NaN    8.0
0    A       1.0    NaN
1    B       2.0    NaN
2    C       3.0    NaN
3    D       4.0    NaN

In [28]:
pd.concat([df3,df4], axis = 1)

  item  value item  quantity
0    E      5    A         1
1    F      6    B         2
2    G      7    C         3
3    H      8    D         4

In [31]:
df1 = pd.DataFrame({'item': ['A','B','C','D'],
                    'value': [1,2,3,4]})
df2 = pd.DataFrame({'item': ['E','F','G', 'H'],
                    'value': [5,6,7,8,]})
df3 = pd.DataFrame({'item': ['I','J','K','L'],
                    'value': [9,10,11,12]})

df1.append([df2,df3])

  item  value
0    A      1
1    B      2
2    C      3
3    D      4
0    E      5
1    F      6
2    G      7
3    H      8
0    I      9
1    J     10
2    K     11
3    L     12

In [44]:
dfA = pd.DataFrame({'Key':['K0','K1','K2','K3','K5'],
                    'A': ['A0','A1','A2','A3','A5'],
                    'B': ['B0','B1','B2','B3','B5']})
dfB = pd.DataFrame({'Key':['K0','K1','K2','K3','K4'],
                    'C': ['C0','C1','C2','C3','C4'],
                    'D': ['D0','D1','D2','D3','D4']})
dfA

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K5  A5  B5

In [39]:
dfB

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K4  C4  D4

In [51]:
#Inner Join
#pd.merge(dfA,dfB,on = 'Key')
#Right Join
#pd.merge(dfA,dfB, how = 'right', on= 'Key')
#Left Join
#pd.merge(dfA,dfB, how = 'left', on = 'Key')
#outer join
pd.merge(dfA,dfB, how = 'outer', on = 'Key')

  Key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K5   A5   B5  NaN  NaN
5  K4  NaN  NaN   C4   D4